tutorials/oldd/old/pimpleDyM_Piston/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2 0 0)
    (-2 0 0.2)
    (2 0 0)
    (2 0 0.2)
    (2 0.5 0)
    (2 0.5 0.2)
    (-2 0.5 0)
    (-2 0.5 0.2)
);

blocks
(
    hex (0 2 4 6 1 3 5 7) (20 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    piston
    {
        type patch;
        faces
        (
	    (0 6 7 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
	    (2 3 5 4)
        );
    }
    walls
    {
        type patch;
        faces
        (
	    (0 2 3 1)
	    (4 6 7 5)
        );
    }
    front
    {
        type empty;
        faces
        (
	    (1 3 5 7)
        );
    }
    back
    {
        type empty;
        faces
        (
	    (0 6 4 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
